# 01. Importing libraries

In [4]:
# Import libraries
import pandas as pd
import numpy as np
import os

# 02.Importing Data

In [16]:
#creating path
path = r'C:\Users\shrav\_Data_Analysis_CF\career_foundry\31-05-2020_InstacartBasketAnalysis'

In [17]:
#Import the “orders.csv” data set from the “Prepared Data” folder
df_ords = pd.read_csv(os.path.join(path, '02 Data', 'Prepared Data','orders_wrangled.csv'), index_col = False)

In [18]:
#Import the “products.csv” data set   from the “Original Data” folder
df_prods = pd.read_csv(os.path.join(path, '02 Data', 'Original Data', 'products.csv'), index_col = False)

# 03. Data Consistency Checks

In [19]:
df_ords.describe()

,Unnamed: 0,order_id,user_id,order_number,orders_day_of_week,order_hour_of_day,days_since_prior_order
count,3.421083e+06,3.421083e+06,3.421083e+06,3.421083e+06,3.421083e+06,3.421083e+06,3.214874e+06
mean,1.710541e+06,1.710542e+06,1.029782e+05,1.715486e+01,2.776219e+00,1.345202e+01,1.111484e+01
std,9.875817e+05,9.875817e+05,5.953372e+04,1.773316e+01,2.046829e+00,4.226088e+00,9.206737e+00
min,0.000000e+00,1.000000e+00,1.000000e+00,1.000000e+00,0.000000e+00,0.000000e+00,0.000000e+00
25%,8.552705e+05,8.552715e+05,5.139400e+04,5.000000e+00,1.000000e+00,1.000000e+01,4.000000e+00
50%,1.710541e+06,1.710542e+06,1.026890e+05,1.100000e+01,3.000000e+00,1.300000e+01,7.000000e+00
75%,2.565812e+06,2.565812e+06,1.543850e+05,2.300000e+01,5.000000e+00,1.600000e+01,1.500000e+01
max,3.421082e+06,3.421083e+06,2.062090e+05,1.000000e+02,6.000000e+00,2.300000e+01,3.000000e+01

#  3.1 Finding and addressing mixed data types

In [20]:
# create a new dataframe
df_test = pd.DataFrame()

In [21]:
# Create a mixed type column
df_test['mix'] = ['a', 'b', 1, True]

In [22]:
df_test.head()

    mix
0     a
1     b
2     1
3  True

In [23]:
#checking whether a dataframe contains any mixed-type columns

for col in df_test.columns.tolist():
    weird= (df_test[[col]].map(type)!=df_test[[col]].iloc[0].apply(type)).any(axis=1)
    if len (df_test[weird])>0:
        print (col)

mix

In [24]:
# Convert column's data from numeric to string
df_test['mix'] = df_test['mix'].astype('str')

## 04. Missing Values

In [25]:
#Finding Missing Values
df_prods.isnull().sum()

product_id        0
product_name     16
aisle_id          0
department_id     0
prices            0
dtype: int64

In [26]:
# Create subset of the dataframe that contains the nulls
df_nan = df_prods[df_prods['product_name'].isnull() == True]

In [27]:
df_nan

       product_id product_name  aisle_id  department_id  prices
33             34          NaN       121             14    12.2
68             69          NaN        26              7    11.8
115           116          NaN        93              3    10.8
261           262          NaN       110             13    12.1
525           525          NaN       109             11     1.2
1511         1511          NaN        84             16    14.3
1780         1780          NaN       126             11    12.3
2240         2240          NaN        52              1    14.2
2586         2586          NaN       104             13    12.4
3159         3159          NaN       126             11    13.1
3230         3230          NaN       120             16    14.4
3736         3736          NaN        41              8    14.8
4283         4283          NaN        77              7    14.4
4790         4790          NaN        91             16    14.5
38187       38183          NaN        39             12    20.9
40444       40440          NaN       120             16    14.8

In [28]:
df_nan.describe()

         product_id    aisle_id  department_id     prices
count     16.000000   16.000000      16.000000  16.000000
mean    6684.000000   89.937500      10.937500  13.012500
std    12836.665242   33.731229       4.639953   3.881731
min       34.000000   26.000000       1.000000   1.200000
25%      459.250000   70.750000       7.750000  12.175000
50%     2413.000000   98.500000      11.500000  13.650000
75%     3872.750000  120.000000      14.500000  14.425000
max    40440.000000  126.000000      16.000000  20.900000

In [29]:
# There are several ways to deal with missing data:
# 1. Create a new variable that acts like a flag based on the missing value
# 2. Impute the value with the mean or median of the column (if the variable is numeric)
# 3. Remove or filter out the missing data

In [30]:
# If you choose to impute using the mean, use the following code to replace the missing values:
# df['column with missings'].fillna(mean value, inplace=True)
# If you choose to impute using the median, use the following code to replace the missing values:
# df['column with missings'].fillna(median value, inplace=True)

In [31]:
# Looking at df_nan it's clear imputation isn't an option because the data-type is a string
# You can either remove the missing values entirely or filter the non-missing values into a subset dataframe

In [32]:
df_nan.median()

product_id       2413.0
product_name        NaN
aisle_id           98.5
department_id      11.5
prices            13.65
dtype: object

In [33]:
# Find shape of df
df_prods.shape

(49693, 5)

In [34]:
# Create new df without the nulls
df_prods_clean = df_prods[df_prods['product_name'].isnull() == False]

In [35]:
# Should have exactly 16 less rows(the same as the number of missing values)
df_prods_clean.shape

(49677, 5)

In [36]:
#Another way you can drop all missing values is via the following command:
#df_prods.dropna(inplace = True)
#If you wanted to use this command to drop only the NaNs from a particular column, the code would look like this:
#df_prods.dropna(subset = [‘product_name’], inplace = True)

## 05. Duplicates

In [37]:
#Finding Duplicates
# Create subset of df_prods_clean that contains only rows of duplicates
df_dups = df_prods_clean[df_prods_clean.duplicated()]

In [38]:
df_dups

,product_id,product_name,aisle_id,department_id,prices
462,462,Fiber 4g Gummy Dietary Supplement,70,11,4.8
18459,18458,Ranger IPA,27,5,9.2
26810,26808,Black House Coffee Roasty Stout Beer,27,5,13.4
35309,35306,Gluten Free Organic Peanut Butter & Chocolate ...,121,14,6.8
35495,35491,Adore Forever Body Wash,127,11,9.9

In [39]:
#Addressing Duplicates
# the current number of rows in the current dataframe
df_prods_clean.shape

(49677, 5)

In [40]:
# Create datafram that doesn't include the duplicates
df_prods_clean_no_dups = df_prods_clean.drop_duplicates()

In [41]:

df_prods_clean_no_dups.shape

(49672, 5)

## 06. Exporting Changes

In [42]:
df_prods_clean_no_dups.to_csv(os.path.join(path, '02 Data', 'Prepared Data', 'products_checked.csv'))

# Exercise 4.5 Task

# step 2:

In [43]:
df_ords.describe()

,Unnamed: 0,order_id,user_id,order_number,orders_day_of_week,order_hour_of_day,days_since_prior_order
count,3.421083e+06,3.421083e+06,3.421083e+06,3.421083e+06,3.421083e+06,3.421083e+06,3.214874e+06
mean,1.710541e+06,1.710542e+06,1.029782e+05,1.715486e+01,2.776219e+00,1.345202e+01,1.111484e+01
std,9.875817e+05,9.875817e+05,5.953372e+04,1.773316e+01,2.046829e+00,4.226088e+00,9.206737e+00
min,0.000000e+00,1.000000e+00,1.000000e+00,1.000000e+00,0.000000e+00,0.000000e+00,0.000000e+00
25%,8.552705e+05,8.552715e+05,5.139400e+04,5.000000e+00,1.000000e+00,1.000000e+01,4.000000e+00
50%,1.710541e+06,1.710542e+06,1.026890e+05,1.100000e+01,3.000000e+00,1.300000e+01,7.000000e+00
75%,2.565812e+06,2.565812e+06,1.543850e+05,2.300000e+01,5.000000e+00,1.600000e+01,1.500000e+01
max,3.421082e+06,3.421083e+06,2.062090e+05,1.000000e+02,6.000000e+00,2.300000e+01,3.000000e+01

In [44]:
# Potential Issues to Investigate

#1. `order_number` Maximum Value:
   #The maximum value of `order_number` is 100. This is unusually high for a typical customer,although it could be possible for a very frequent shopper. This value should be verified to ensure it is not an error.

#2. `order_hour_of_day` Values:
   #The values for `order_hour_of_day` range from 0 to 23,which is expected as these represent hours in a day. However, there are no issues here.

#3. `orders_day_of_week` Values:
    #The values range from 0 to 6, representing the days of the week.This is correct and does not require further investigation.

#4. `days_since_prior_order` Values:
     #The range is from 0 to 30, which appears reasonable for most shopping cycles.However, the presence of 0 could indicate same-day orders or missing data. It might be beneficial to check the frequency of 0 values to determine if they are plausible or a sign of missing data.

#5. `Unnamed: 0` Column:
   #The `Unnamed: 0` column is likely an index column from the original data source. It might not be necessary for analysis and could be dropped if it serves no useful purpose.

#Overall, the data seems mostly consistent, but it would be prudent to investigate the `order_number` values 
#further to ensure they are accurate and check the frequency and context of `days_since_prior_order` values of 0.

# Step 3:

In [45]:
#checking whether a dataframe contains any mixed-type columns

for col in df_test.columns.tolist():
    weird= (df_test[[col]].map(type)!=df_test[[col]].iloc[0].apply(type)).any(axis=1)
    if len (df_test[weird])>0:
        print (col)

# Step 4:

In [46]:
# There's no mixed data present in the df_ords dataframe
df_ords.dtypes

Unnamed: 0                  int64
order_id                    int64
user_id                     int64
order_number                int64
orders_day_of_week          int64
order_hour_of_day           int64
days_since_prior_order    float64
dtype: object

# Step 5:

In [47]:
#Finding Missing Values
df_ords.isnull().sum()

Unnamed: 0                     0
order_id                       0
user_id                        0
order_number                   0
orders_day_of_week             0
order_hour_of_day              0
days_since_prior_order    206209
dtype: int64

In [48]:
# Findings:
# The only column with missing values is days_since_prior_order, which has 206,209 missing entries.

# Explanation for Missing Values:
# The days_since_prior_order column likely indicates the number of days since a user's last order. 
# There are several potential explanations for the missing values:

# 1. First Orders:
#    Missing values could correspond to users' first orders, where there is no prior order to calculate the days since.
#    This is a common reason for missing values in such datasets.

# 2. Data Entry Errors:
#    There could be instances of data entry errors or omissions during data collection and processing.

# 3. Special Cases:
#    Certain orders might be special cases (e.g., guest checkouts or manually entered orders) 
#    where prior order information is not recorded or applicable.

# Recommendations:

# 1. Verify with First Order Data:
#    we need to check if the missing days_since_prior_order values align with users' first orders. 
#    This can be done by examining the order_number column. 
#    If order_number is 1 for these missing entries, it supports the first-order hypothesis.

# 2. Impute or Leave as Is:
#    If the missing values are due to first orders, it might be appropriate to leave them as missing 
#    or impute them with a specific value (e.g., -1 or a placeholder indicating "first order").

# 3. Further Investigation:
#    Perform additional checks to ensure there are no systematic data entry issues 
#    and that all entries are consistent with the expected data structure.

# Step 6:

In [49]:
# Create subset of the dataframe that contains the nulls
df_ords_nan = df_ords[df_ords['days_since_prior_order'].isnull() == True]

In [50]:
df_ords_nan

,Unnamed: 0,order_id,user_id,order_number,orders_day_of_week,order_hour_of_day,days_since_prior_order
0,0,2539329,1,1,2,8,NaN
11,11,2168274,2,1,2,11,NaN
26,26,1374495,3,1,1,14,NaN
39,39,3343014,4,1,6,11,NaN
45,45,2717275,5,1,3,12,NaN
...,...,...,...,...,...,...,...
3420930,3420930,969311,206205,1,4,12,NaN
3420934,3420934,3189322,206206,1,3,18,NaN
3421002,3421002,2166133,206207,1,6,19,NaN
3421019,3421019,2227043,206208,1,1,15,NaN
3421069,3421069,3154581,206209,1,3,11,NaN

In [51]:
df_ords_nan.describe()

,Unnamed: 0,order_id,user_id,order_number,orders_day_of_week,order_hour_of_day,days_since_prior_order
count,2.062090e+05,2.062090e+05,206209.000000,206209.0,206209.000000,206209.000000,0.0
mean,1.712637e+06,1.708462e+06,103105.000000,1.0,2.754118,13.626597,NaN
std,9.874816e+05,9.881299e+05,59527.555167,0.0,2.076205,4.223769,NaN
min,0.000000e+00,2.000000e+01,1.000000,1.0,0.000000,0.000000,NaN
25%,8.579730e+05,8.507300e+05,51553.000000,1.0,1.000000,11.000000,NaN
50%,1.717068e+06,1.706246e+06,103105.000000,1.0,3.000000,14.000000,NaN
75%,2.570518e+06,2.564292e+06,154657.000000,1.0,5.000000,17.000000,NaN
max,3.421069e+06,3.421081e+06,206209.000000,1.0,6.000000,23.000000,NaN

In [52]:
# Verify if missing values in 'days_since_prior_order' are for first orders
df_first_orders = df_ords_nan[df_ords_nan['order_number'] == 1]

In [53]:
# Check if all of these have missing values in 'days_since_prior_order'
df_first_orders_missing = df_first_orders['days_since_prior_order'].isna().all()

In [54]:
# Print the result
print("All first orders have missing 'days_since_prior_order':", df_first_orders_missing)

All first orders have missing 'days_since_prior_order': True

In [55]:
# We know for certain that every row with 'order_number' equal to 1 has a missing value in the'days_since_prior_order' column
# Address the missing values by creating a column that flags order numbers as either True/False depending on if the 'order_number' = 1
df_ords['first_order'] = df_ords['days_since_prior_order'].isna()

In [56]:
df_ords

,Unnamed: 0,order_id,user_id,order_number,orders_day_of_week,order_hour_of_day,days_since_prior_order,first_order
0,0,2539329,1,1,2,8,NaN,True
1,1,2398795,1,2,3,7,15.0,False
2,2,473747,1,3,3,12,21.0,False
3,3,2254736,1,4,4,7,29.0,False
4,4,431534,1,5,4,15,28.0,False
...,...,...,...,...,...,...,...,...
3421078,3421078,2266710,206209,10,5,18,29.0,False
3421079,3421079,1854736,206209,11,4,10,30.0,False
3421080,3421080,626363,206209,12,1,12,18.0,False
3421081,3421081,2977660,206209,13,1,12,7.0,False
3421082,3421082,272231,206209,14,6,14,30.0,False

In [57]:
# Check data-type of new column and update if necessary
df_ords['first_order'].dtype

dtype('bool')

In [58]:
# Re-check data to make sure if there are any missing values
df_ords.isnull().sum()

Unnamed: 0                     0
order_id                       0
user_id                        0
order_number                   0
orders_day_of_week             0
order_hour_of_day              0
days_since_prior_order    206209
first_order                    0
dtype: int64

In [61]:
# Missing values have been addressed appropriately, now the client can see why there are missing values in the 'order_number' column
# Removing/filtering these values would've been incorrect because the missing data is quite valuable

# Step 7:

In [62]:
# Create subset of df_ords that contains only rows of duplicates
df_ords_dups = df_ords[df_ords.duplicated()]

In [63]:
df_ords_dups

Empty DataFrame
Columns: [Unnamed: 0, order_id, user_id, order_number, orders_day_of_week, order_hour_of_day, days_since_prior_order, first_order]
Index: []

In [64]:
# The dataframe created to check duplicates has returned empty, meaning there are no duplicates in the data set

# Step 8:

In [65]:
df_prods_clean_no_dups.describe()

         product_id      aisle_id  department_id        prices
count  49672.000000  49672.000000   49672.000000  49672.000000
mean   24850.349775     67.762442      11.728942      9.993282
std    14340.705287     38.315784       5.850779    453.615536
min        1.000000      1.000000       1.000000      1.000000
25%    12432.750000     35.000000       7.000000      4.100000
50%    24850.500000     69.000000      13.000000      7.100000
75%    37268.250000    100.000000      17.000000     11.100000
max    49688.000000    134.000000      21.000000  99999.000000

In [66]:
# To address the presence of duplicates in the dataframe containing product information, I utilized the `drop_duplicates()` method in pandas. 
# Here's why this method was chosen:

# Method Chosen: Dropping Duplicates

# 1. Simple and Effective:
#    - The `drop_duplicates()` method is a straightforward and effective way to eliminate duplicate rows from a dataframe. 
#      It automatically identifies and removes duplicate rows based on their values.

# 2. Preservation of Data Integrity:
#    - By dropping duplicate rows, we ensure that each product in the dataframe is represented by a unique row, 
#      thus preserving the integrity of the data.

# 3. Efficiency:
#    - The method efficiently handles the removal of duplicate rows without the need for manual intervention or complex procedures.

# By utilizing this method, we can ensure that the product information dataframe is free from duplicates and ready for further analysis.

# Step 9:

In [67]:
# Exporting df_ords dataframe as "orders_checked.csv"
df_ords.to_csv(os.path.join(path, '02 Data','Prepared Data', 'orders_checked.csv'))

In [69]:
# Exporting df_prods_clean_no_dups dataframe as "products_checked.csv"
df_prods_clean_no_dups.to_csv(os.path.join(path, '02 Data', 'Prepared Data', 'products_checked.csv'))